# IsValidDistributionSystem Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalEquipment..::..IsValidDistributionSystem Method
ElectricalEquipment Class See Also
---
Verifies that the Distribution System can be assigned to the Electrical Equipment.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public bool IsValidDistributionSystem(
	DistributionSysType distributionSystem
)
```

Visual Basic
---
```text
Public Function IsValidDistributionSystem ( _
	distributionSystem As DistributionSysType _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidDistributionSystem(
	DistributionSysType^ distributionSystem
)
```

# ### Parameters
distributionSystem
    Type: Autodesk.Revit.DB.Electrical..::..DistributionSysType The Distribution System to be checked.
# ### Return Value
True if the Distribution System can be assigned to the Electrical Equipment.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace